Documents/PriceList.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>PriceList</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Description</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DefaultPriceList</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Prices</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>SKU</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.SKU</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Price</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/Prices.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>Prices</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Price</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>PriceList</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.PriceList</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>SKU</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.SKU</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/PriceList/Ext/ObjectModule.bsl
Procedure OnWrite(Cancel)
	
	If Not Cancel Then
		
		If AdditionalProperties.Property("Prices") Then
		
			RecordSet = InformationRegisters.Prices.CreateRecordSet();
			RecordSet.Filter.PriceList.Set(ThisObject.Ref);
			
			PricesVT = AdditionalProperties.Prices;
			Query = New Query(
			"SELECT
			|	&PriceList,
			|	Prices.SKU,
			|	Prices.Price
			|INTO PricesVT
			|FROM
			|	&Prices AS Prices
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|SELECT
			|	PricesVT.PriceList,
			|	PricesVT.SKU,
			|	PricesVT.Price
			|FROM
			|	PricesVT AS PricesVT
			|WHERE
			|	NOT PricesVT.SKU = VALUE(Catalog.SKU.EmptyRef)");
			Query.SetParameter("PriceList", ThisObject.Ref);
			Query.SetParameter("Prices", PricesVT);
			Result = Query.Execute().Unload();
			
			RecordSet.Load(Result);
			
			RecordSet.Write();
			
		EndIf;
		
	EndIf;
	
EndProcedure
